"""
ЗАДАНИЕ
--------------------------------------------------------------------------------
Написать рекурсивную функцию fib для вычисления n первых чисел Фибоначчи.
Примеры вызова:
fib(5) -> 0,1,1,2,3
fib(10) -> 0,1,1,2,3,5,8,13,21,34
"""


def fib(n, arr=[0]):
    if n == 0:
        return arr

    if len(arr) < 2:
        return fib(n - 1, arr + [1])

    return fib(n - 1, arr + [arr[-1] + arr[-2]])


if __name__ == '__main__':
    print(*fib(11), sep=',')
    assert fib(11) == [0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
print('Решено!')
