#3. Написать функцию для вычисления n первых чисел Фибоначчи.
#Примеры вызова: 
#fib(5) -> 0,1,1,2,3
#fib(10) -> 0,1,1,2,3,5,8,13,21,34


def fib(n):
    a,b = 0,1
    for i in range(n):
        yield a
        a,b = b,a+b

print(list(fib(10)))

